--- a/docs/data-structures/Tree/bk-tree.md
+++ b/docs/data-structures/Tree/bk-tree.md
@@ -1,14 +1,5 @@
 ### BK Tree
 
-<div style="text-align: center;">
-```mermaid
-flowchart TB
-    Foo -- 1 --> Fool -- 2 --> Fox
-    Foo -- 3 --> Bar
-```
-</div>
-
-
@@ -26,3 +17,33 @@ bk_tree_free(&tree);
+
+=== "Visualization"
+
+    ```dot
+    digraph tree {
+        n0x55a93b7d2350 [label="Foo"]
+        n0x55a93b7d2350 -> n0x55a93b7d23a0 [color="#2257ab", label=" 3 "]
+        n0x55a93b7d23a0 [label="Bar"]
+        n0x55a93b7d23d0 [label="Fool"]
+        n0x55a93b7d2350 -> n0x55a93b7d23d0 [color="#2257ab", label=" 1 "]
+        n0x55a93b7d23d0 [label="Fool"]
+        n0x55a93b7d23d0 -> n0x55a93b7d2480 [color="#2257ab", label=" 2 "]
+        n0x55a93b7d2480 [label="Fox"]
+    }
+    ```
+
+=== "dot"
+
